blog/2010/look-v3.0-revision-from-teacher-network-development.org
#+TITLE: 从名师网V3.0改版看发展
#+AUTHOR: Gu Weigang
#+EMAIL: guweigang@outlook.com
#+DATE: 2010-05-11 Tue
#+URI: /blog/2010/05/11/look-v3.0-revision-from-teacher-network-development/
#+KEYWORDS: 
#+TAGS: 名师网
#+LANGUAGE: zh_CN
#+OPTIONS: H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: 

[[http://www.mingshi.com][名师网]]的定位是基础教育服务专家。我全程参与了名师网第2版的开发，可以说第二版仍是以门户为主，是2.0时代的1.0产物。

名师网3.0版终于顺应互联网形势改成2.0格局了。但此次我的工作是辅助名师网第3版的开发工作，工作量并不大。现在开发工作基本完成，是应该跳到更高的层次来看看这次改版的成果与不足。


-  从1.0过渡到2.0, 以用户为中心，以互动服务为主体业务
-  有艾瑞专业团队的帮助，在业务流程上有了很大的改进
-  名师网主管们全程参与改版工作，对互联网有了新的认识，特别是对名师网的发展有了更清晰的思路
-  多次改版，名师网编辑们的业务素质也在不断提高


仍存在的一些不足：



-  时间太短，工作不够细致
-  仍然使用第三方技术支持，给以后维护带来很大不便
-  资源没有完全独立且没有得到良好的组织


那么今后我认为名师网应把技术和内容彻底分开，尤其是内容要独立出来，这样的话名师网就既可以做为内容提供商（无论什么终端设备），也可以做技术提供商。
1. 把内容组织好了，那么我们既可以发行杂志也可以为学校提供资源，有些学校已有相关的系统，此时我们只需提供内容即可。
2. 技术独立了，技术团队就可以专注产品的研发，包括CMS系统，视频集成方案等等。我们也可以提供教育行业的技术解决方案了。

另外，名师网3.0版本中有四种角色-普通用户、老师、家长、学生，我觉得仍应添加第五种角色-学校。各个学校可以购买学校帐户，这样一来该学校的老师都可以使用该帐号来名师网获取资源，这种模式可以参考学术期刊网如知网、万方数据。

最后，应邀各个学校老师投稿，特别是在教研教改心得及创新教育思路方面，这种资源正好适用于学校帐号。


